var te=`
この項では英語の文法を解説する。

以下では現代言語学における一般的な生成文法に基づく構文記法ではなく、日本の義務教育や高校教育で使われる、所謂伝統文法に基づく構文記法を採用する。生成文法に基づく英文法の理論については英語学#統語論を参照。

文法的特徴
他の印欧諸語、特に欧州の諸言語と比較して、現代英語には以下のような文法的特徴がある。

名詞に性がない。a と an、these と those といったごく一部の限定詞だけが、数によってのみ変化する。
動詞の変化が単純化・簡易化している。しかし不規則動詞の数は比較的多い。規則動詞の変化形は過去時制の -ed、現在時制・動名詞の -ing、三人称単数現在形の -(e)s のみである。不規則動詞では現在形、過去形、過去分詞で語幹変化が見られる。
西欧の言語の大半と同じく、名詞の格変化がほぼ消失しており、代名詞に残るのみである。但し、該当の他言語とは大きく異なり、加えて動詞の人称活用もほとんどないため、格関係を示すものとして、前置詞以外には、語順が非常に大きな役割を持っている。
複雑な時間表現がある。下記の時制の章を参照。
否定文、疑問文で無内容の助動詞 do を用いる。これは英語以外の印欧語にはあまり見られない特徴である。
主語の働きが強く、形式主語文や無生物主語文などが発達している。
二人称では単複・親疎の区別をせず you のみを使う。
名詞
代名詞
人称代名詞については英語の人称代名詞を参照。

人称疑問詞・関係代名詞 「who」 の格変化
人称疑問詞・関係代名詞who は、単複関係なく主格 who / 所有格 whose / 目的格 whom の格変化をするのみである。
名詞
可算名詞と不可算名詞
英語には可算名詞と不可算名詞の区別がある。何が不可算であるか、日本人にとってわかりにくいものが多い。例えば furniture「家具」や集合的に扱われる fruit「果物」は不可算だが、vegetable「野菜」は可算で、「two pieces of cloud」「many drops of tear」と言いたくなるところが「two clouds」「many tears」となる。学問名のmathematics「数学」などは、-s がついているにもかかわらず不可算で、単数扱いである。
常に複数の名詞
pants「ズボン」、glasses「めがね」、scissors「はさみ」などは常に複数形で使われる。police「警察」、people「人民」、human「人」、cattle「牛」のような集合名詞も複数として扱われる。逆にthe United Statesやthe United Nationsのような「連合体」はつづりは複数でも単数扱い。
名詞による名詞の修飾と数
別の語を修飾している名詞は複数形にならない（例: a two-way communication [双方向通信]）。
複数変化
可算名詞には単数形では不定冠詞をつけ、複数では語尾に「s」を付する。語が無声音で終わっていれば発音は /s/、有声音なら /z/ となる。歯擦音に終わる語ではes /ɨz/ を付する（例: dish/dishes）。また「f」/f/ で終わる語の中には /f/ が有声化し /v/ となる語があり、つづりの上では f を v に変えて es /z/ を加える（例: leaf/leaves）。o で終わる語は、その前の字が子音字の場合は es /z/ を加える（例: potato/potatoes、ただしzeroは例外的にzeros、patioは直前が子音字でないのでpatios）。y で終わる語は、その前の字が子音字の場合は y を i に変えて es を加える（例: company/companies、ただしkeyはyの直前が子音字でないのでkeys）。
一部の名詞は不規則に変化する。歴史的には、古英語時代にはさまざまな複数形の作り方があったのが、-s 形に統一されていったもので、これらの語は古形が残存したものであることが多い。

単複同形　（例: sheep、aircraft）
母音が変化するもの　（例: man/men、foot/feet）
-en がつくもの　（例: ox/oxen、child/children）　など
ほかに、借用語では元の言語の変化方法に従うことが多い（例: medium/media、fungus/fungi）。

名詞の所有表現
ある名詞が何らかを所有していることを表し直後に置かれる他の名詞を形容詞的に修飾する場合、もとの語が歯擦音で終わっているならば /ɨz/ を、無声音で終わっている場合は /s/ を、有声音で終わっている場合は /z/ をつける。正書法上はいずれも 's と記す。ただし -s に終わる複数の場合は何もつけず、つづりの上では '（アポストロフィのみ）を付する。-s で終わる固有名詞でも ' のみをつける場合がある。's は歴史的には属格に由来するが、属格と異なり、たとえば「スペイン王の」は king of Spain's と言い、*king's of Spain にはならない。
また、前置詞 of を用いて所有関係を表す。このフランス語からの借用表現は英語の表現の自由度を向上させた。
例：

The judge's decision / Decision of the judge :裁判官の決定
The judges' decision / Decision of the judges :裁判官たちの決定
Horus' battleship / Battleship of Horus :ホルスの戦艦
派生名詞
他の品詞の語に語尾を追加して名詞化する例が多い。
動詞 + -er または -or …する人 例:batter
動詞 + -ing …すること 例:batting
動詞 + -ment …すること 例:settlement
形容詞 + -ness …であること 例:madness
形容詞 + -ity …であること 例:possibility
形容詞 + -ality …であること 例:commonality
形容詞 + -ist …である人 例:specialist
名詞 + -ism …主義または傾向 例:capitalism
名詞 + -ist …主義者 例:capitalist
元の品詞と意味の派生方法は代表的なものだけを示した。
逆に言えば、これらの語尾で終わる英単語はほぼ間違いなく名詞である。逆にeditor（ラテン語editorより）という名詞から editという動詞、butcher（フランス語boucherより）という名詞から butchという動詞を創出するケースも稀にある。
動詞
一般動詞は、法、数、人称による活用をほぼ消失しており、三人称単数現在形で-sが付されるだけである。時制による変化は不規則変化動詞においては現在形、過去形でそれぞれ変化するが、規則変化動詞では過去形に -ed 語尾が付されるのみとなる。また、動名詞・現在分詞においては全ての動詞において原形に -ing 語尾を付すれば良い。 現在分詞や過去分詞は形容詞として扱われる。

フランス語やドイツ語と違い、不定形に一見して動詞とわかる綴りの形はない。したがってある単語の原形が与えられたとき、動詞かどうか判断する手段はない。このため語形を変えずに品詞の転換が容易である。例:smoke は名詞では「煙」「タバコの一服」だが、そのまま動詞として「煙を出す」「タバコを吸う」としても使える。

法
英語の法は直説法、接続法、命令法、条件法が存在する。

直説法
一般動詞においては過去形、過去分詞形、現在分詞形、動名詞、三人称単数現在形以外では目に見える形で活用せず、実質原形を用いる。
仮定法
中英語期以前までは、現在・過去のいずれの時制でも現れ、それぞれ固有の語形変化をもっていたが、現代では仮定法自体やや特殊な用法となっている。 if などを用いた条件節内においては一般動詞を過去形に、be動詞の場合は were にすることによって法を表現し、条件節以外では助動詞の過去形を用いることによって表現する。仮定法本来の動詞変化が消失したためにこのような形で表現するのであるが、そのせいで動詞の語形変化で表される時制と、仮定法によって叙述される時制にズレが生じる。
例:If I were a bird, I could fly into the sky. 「もし私が鳥ならば、空に向かって飛んでいけるのだが。」
これを「仮定法過去」といい、叙述されているのは現在の状態・動作である。
仮定法によって過去の状態・動作を叙述するには、次のような構造を用いる。
例:If I had been a bird, I could have flown into the sky. 「もし私が鳥だったならば、空に向かって飛んでいけたのだが。」
条件節内を「助動詞 have の過去形 had+過去分詞」とし、主節内を「助動詞過去形+助動詞 have+過去分詞」とする。これを「仮定法過去完了」という。
仮定法の条件節において if を使わず、助動詞を倒置させることがしばしばある。
例:Had I had the money, I could have made my fortune. 「あの金さえあればひとやま築けたのに。」
命令法
動詞を原形で文の最初に置くことによって表現する。命令法以外では文頭に動詞の原形が置かれることはほとんど無い。
例:Be quiet. 「静かにしなさい」 Go to school. 「学校に行け」 Open the window. 「窓を開けなさい」
時制
英語の基本的な時制は非過去と過去の二つである。これはゲルマン語派系言語に共通する特徴である。過去形は不規則変化動詞においては語幹変化で、規則変化動詞においては -ed 語尾を付して表現する。本来英語には未来時制がないので、未来のことを表現するときは法の助動詞 will, shall を用いて表現したり be going to という慣用表現を用いたりする。直近の予定は現在進行形で表現することもある。

英語の時制、法、相、態は以下のように結びつく。

時制	法	相	態	動詞
完了相	進行相
Ø （非過去）
-ed （過去）

Ø （通常）
will （未来）

Ø （通常）
have -ed （完了）

Ø （通常）
be -ing （進行）

Ø （能動）
be -ed （受動）

do
時制、法、完了、進行が各2通りあるので、実質的な時間表現は16通りある。不定詞では相および態しか使えない。本来の時制の他、will による未来表現も時制に入れることがある。この場合、-Øが現在、-edが過去、willが未来、wouldが過去未来と呼ばれる。

相
英語の相は、完了形と進行形が存在する。

完了相
「助動詞 have + 過去分詞形動詞」によって表される。助動詞 have を過去形 had にすることにより、完了相の時制を表現することが可能である。
現在完了の例:She has gone to India.「彼女はインドへ行ってしまった。」
過去完了の例:He said that she had gone to India.「彼は、彼女がインドに行ってしまったのだと言った。」
過去完了を用いることにより、間接話法中において、時制の差異を表現することができる。これを「大過去」ともいう。
現在完了と過去時制との違いは、後者が過去における事実を叙述するに過ぎないのに対し、前者は過去の行為が現在に及ぼす影響を含んでいること。したがって現在完了は経験や継続を表すのに使われる。
現在完了の例:She has gone to India.「彼女はインドへ行ってしまった。」そのまま戻っていない。
過去の例:She went to India.「彼女はインドに行った。」もう戻っているかもしれないし、戻っていないかもしれない。
現在完了の例:She has lived in India.「彼女はインドに住んだ経験がある」または「彼女はインドに住み続けている。」
過去の例:She lived in India.「彼女はインドに住んでいた。」現在どこに住んでいるかは叙述していない。
古くは自動詞の完了相は「助動詞be + 過去分詞形動詞」によって表されていた。現在でも少数の自動詞は慣用的にこの形をとる。「少数」とはいえ、慣用により頻出である。
例 He is gone. 「彼は行ってしまった。」
例 The sun is set. 「日は沈んでしまった。」
例 I'm done with it. 「私はもう済みました。」
進行相
「助動詞 be + 現在分詞形動詞」によって表される。ただし動作を表す動詞にしか用いることはできない。また助動詞 be を過去形 was, were にすることにより、進行相の過去時制を表現することが可能である。
現在進行形の例:She is playing tennis.「彼女はテニスをしている。」
過去進行形の例:She was playing tennis.「彼女はテニスをしていた。」
態
英語の態は能動態と受動態があり、能動態においては動詞によって表される状態・動作を主語が行うことを表す。一方受動態は、主語が何らかの動作を「されている」ことを表す。受動態は「助動詞 be + 過去分詞」で表現され、その場合の真の動作主は by で導かれる前置詞句によって表される。ただし、他動詞に限定され、能動態において目的語を取らない自動詞は受動態にできない。また、助動詞 be を過去形 was, were にすることにより、受動態の時制を表現することが可能である。

「能動態」の例:He built the dog house.「彼は犬小屋を造った。」
「受動態」の例:The dog house was built. 「犬小屋が造られた。」
これらの法・時制・相を組み合わせて複雑な時間軸・動作の表現をすることも論理上可能になる。

例:He would say that the building had been being built.「彼は言っただろう、その建物は建設中であったと。」
be動詞の活用
原形は be である。仮定法過去においては人称に関係なく were となる。過去分詞形は been、現在分詞、動名詞は being である。

直説法	一人称	二人称	三人称
単数	複数		単数	複数
現在形	am	are	are	is	are
過去形	was	were	were	was	were
人称代名詞とbe動詞の関係
be動詞の変化の仕方などについては、下の表を参照。be動詞は進行形にも使用される。

標準的な現代英語における人称代名詞と対応するbe動詞
人称	主格
(~が/~は)	目的格
(~に/~を)	所有格
(~の)	所有代名詞
(~のもの)	再帰代名詞
(~自身)	対応するbe動詞
現在形	過去形	過去分詞	現在分詞
単数	一人称 (私)	I	me	my	mine	myself	am	was	been	being
二人称 (あなた)	you	your	yours	yourself	are	were
三人称	男性 (彼)	he	him	his	himself	is	was
女性 (彼女)	she	her	hers	herself
中性 (それ)	it	its	-	itself
複数	一人称 (私たち)	we	us	our	ours	ourselves	are	were
二人称 (あなた達)	you	your	yours	yourselves
三人称 (彼ら/彼女ら/それら)	they	them	their	theirs	themselves

例
I'm Jim. 私はジムです。
You're playing soccer. あなたはサッカーをしています。
She was young.　彼女は若かった。
It's cold.　寒い。
Is she a teacher?　彼女は先生ですか?
What are those?　あれらは何ですか？
Who left their dirty socks on the breakfast table? 誰が朝食机の上に汚れた靴下を放置したの？
動詞を原形で用いる場合
原形で使用する場合もある。

助動詞の後　例　It must be true.　それは本当に違いない。
不定詞のとき　例　Be sure to be there at ten.　10時には必ずそこに行きなさい。
命令文のとき　例　Be quiet.　どうか静かにしてくれ。
要求・提案を表す動詞につづくthat節。ただし、イギリス英語ではshould+動詞の原形となる。　例　I demanded that they be present at all classes. 私は彼らがすべての授業に出ることを要求した。
助動詞
助動詞は法、相などの文法的機能を担い、意味を担う本動詞と共に用いる。

不定詞を後置する場合
助動詞には直後に原形不定詞を置くものと to不定詞を置くものがある。中でも可能・義務・予定など、話者の意思を表すものは法助動詞と呼ばれ、助動詞の中でも使用の頻度が高い。
法助動詞の例:can, will, shall, may, must, need, dare
古英語・中英語期に、一般動詞として使用されてきたものが転じて助動詞となったものがある。must を除く法助動詞は過去形を持ち、本動詞の代わりに語形変化をして過去時制を表す。
例:Once I could swim very well.「私はかつて、上手く泳げた。」
英語には元来未来時制は存在しないが、will, shall, be going to を用いることによって未来を表せる。
分詞を後置する場合
分詞を後置する助動詞には have, be があり、各々過去分詞・現在分詞と結びついて完了相・進行相を形成する。この場合 have, be は主語の人称・数・時制に対応して一般動詞の場合と同様の語形変化をする。
疑問文と否定文の形成
助動詞が無い文の場合
助動詞が無い肯定文を疑問文・否定文にするには、助動詞 do を用いる。その場合の do は主語の人称・数・時制に対応して語形変化する。その際の語順は、疑問文の場合「助動詞 do →主語 →本動詞」となる。
例:Do you swim? 「あなたは泳ぎますか？」
例:Does he swim? 「彼は泳ぎますか？」
例:Did you swim? 「あなたは泳ぎましたか？」
ただしbe動詞と古風なイギリス英語における所有を表す have は、do を使わずに主語と倒置させて疑問文を作る。
例:Are you a swimmer? 「あなたは泳者ですか？」
例:Do you have a pen? 「ペンを持っていますか？」
否定文の語順は「主語→助動詞 do→副詞 not→本動詞」となる。一般に do と not が縮約して don't になる。疑問文と同様、be と古風なイギリス英語における have は、do を用いない。
例:I do not swim. 「私は泳ぎません。」
例:He does not swim. 「彼は泳ぎません。」
例:You did not swim. 「あなたは泳ぎませんでした。」
例:I am not a swimmer. 「私は泳者ではありません。」
例:I do not have any money. 「私はお金をまったく持っていません。」
助動詞がある文の場合
助動詞がある肯定文を疑問文にするには、助動詞を主語の直前に置き語順を「助動詞 - 主語 - 本動詞」にする。
例:Can you swim? 「あなたは泳げますか？」
例:Are you driving? 「運転中ですか？」
また、助動詞の直後に副詞 not を置くことにより否定文を形成する。am と may を除き、n't を含む縮約形がある。ただし口語表現では mayn't という形は存在し、また砕けた表現ではあるものの am not→ain't という表現がある。
例:I will not swim. 「私は泳ぎません。」
例:I am not driving. 「運転中ではありません。」
疑問否定文の形成
否定文をさらに疑問文にするには、助動詞を主語の前に移動する。この時、n't を含む縮約形は1語と見なす。
例:Don't you swim? 「あなたは泳がないのですか？」
例:Aren't you driving a car? 「運転中ではないのですか？」
硬い表現では縮約形を使わないが、この時、not は元の位置に留まる。am と may は縮約形が無いので、必ずこの形式になる。
例:Do you not swim? 「あなたは泳がないのですか？」
例:Are you not a swimmer? 「あなたは泳者ではないのですか？」
否定命令文の形成
動詞の種類にかかわらず don'tを文頭に置く。副詞の never を用いることもある。
例:Don't swim. 「泳ぐな」
例:Don't be surprised. 「驚かないでね」
例:Never mind.「気にするな」
付加疑問文の形成
助動詞と代名詞からなる2語の疑問文を文末に付加し、付加疑問文を形成する。付加疑問文では文中の動詞と同一の時制、相をとる。先行する文が肯定文の場合は付加疑問文は否定文となり、先行する文が否定文の場合は付加疑問文が肯定文となる。つまり先行文と肯定・否定の関係を逆転させる。
例:He will study English, won't he? 「彼は英語を勉強しますね？」
例:He is studying English, isn't he? 「彼は英語を勉強していますね？」
例:He won't study English, will he? 「彼は英語を勉強しませんね？」
例:He isn't studying English, is he? 「彼は英語を勉強していませんね？」
このとき硬い表現での付加否定疑問文では、助動詞→主語→notの語順となる。よって I を主語とした文では 〜, am I not? となるわけであるが、堅すぎるとして口語においては 〜, don't you think? 等と言い換えることがある。
動詞の強調
助動詞 do を本動詞の前に置いて動詞を強調する。
例:I do swim. 「本当に泳ぎます」
この用法は平叙文ではbe動詞に使えないが、命令文では使える。
例:Do be prepared. 「しっかり準備しておいてください。」
疑問文に対する回答で元の動詞を代表する
この用法の do は特に「代動詞」と呼ばれることがある。
例:Do you swim? / Yes, I do. 「あなたは泳がないのですか？」 「はい、泳ぎます。」
例:Can't you swim? / Yes, I can. 「あなたは泳げないのですか？」 「泳げます。」
日本語と違い、疑問が肯定的であるか否定的であるかに関わらず回答が肯定文ならば yes、否定文ならば no で答える。
二重否定
現代英語の規範文法では、二重否定は肯定を意味する。否定を否定することによって強い肯定を表す場合の他に、ためらいなど話者の微妙な感情を表現している場合がある。
I've never done anything illegal.「違法なことをしたことなんか一度もない」。
I'm not uninterested in marrying you.「君との結婚に興味がないわけじゃないんだよ」。[1]
17世紀以前の英語や、今日でも一部の地域方言、また黒人英語に代表される社会方言等では、二重否定は否定の強調として使われることがある。ポップ・ミュージックには少なからず見られる表現である。
We don't need no education.「教育なんか必要ない」[2]
その他の品詞
形容詞
形容詞は古英語期まで修飾する名詞の数・性・格によって変化していたが、現在では消失した。語形変化としては比較級の -er および最上級の -est 接辞がある。3音節以上の語では級変化せず、直前に副詞 more, the most を置く。一部の形容詞には語幹変化するものもある。
英語の形容詞の位置は安定しており、補語となる場合を除き修飾される名詞の前に置かれる。修飾される名詞がsomebody, anybody, nobody, someone, anyone, no one, something, anything, nothingの場合のみフランス語のように後置される。
副詞
元来独立して副詞として存在してきたものに加え、古英語時代の接尾辞 -lice の流れを受け、形容詞に -ly を付けた物が多い。
形容詞や別の副詞を修飾する場合は前置されるが、動詞を修飾する場合は前置の場合と後置の場合がある。
冠詞
詳細は「英語の冠詞」を参照
冠詞は、限定詞の1種。
冠詞には定冠詞the と不定冠詞a/an が存在する。これもすべての格変化を消失している。
前置詞
前置詞は、英語においては特に発達している。理由としては、中英語期まで名詞は主格の他に属格、与格、対格の格変化を持っており、語形変化によって他の語との意味的な関係を表していたが、現代英語に至って格が消失した結果、それを補うために発達したのだと考えられる。
接続詞
接続詞には、等位接続詞と従属接続詞がある。接続詞#英語の接続詞に詳しいので、そちらを参照されたい。
間投詞
間投詞は、Oh, Yeah. などのことばである。
品詞は内容語と機能語に大別される。一般的に、名詞・動詞・形容詞・副詞が内容語、代名詞・助動詞・冠詞・前置詞・接続詞・間投詞が機能語である。be動詞やhaveが助動詞として用いられる場合は、機能語となる。

基本文型
英語は、元来印欧語が持っていた名詞の格変化や動詞の人称変化のほとんどを失ったため、文中の格関係を語順に依存しており、したがって語順が固定的であり「文型」がはっきりしている。

日本の英語教育ではC・T・オニオンズの提唱した5文型という考え方が英語の基本文型として広く使われている。

5文型は、英文の中心をなす主語述語部分において、前置詞無しに語を並べただけで文ができあがっている物を並んだ語の種類によって分類したものと言える。そこで使われている語は主語としての名詞、存在を言う述語としてのbe動詞、作用を言う述語としての一般動詞、主語の性質や状態を言う形容詞、一般動詞の目的語になる名詞、その目的語に対する内容的な述語になる動詞の原形や名詞や形容詞である。ここには文の大基本である主語と述語に含まれている意味への考察がなされていない。そのため意味に基づいて言葉を使用しようとしている学習者にはかえって妨げとなっているのである。

これまでは下記の文型が主要かつ重要なものであるとして扱われてきた。英文の構造の分類法としての5文型は日本以外の国ではあまり一般的ではないが、動詞の語法を説明する上では、「基本5文型」をベースとした動詞型の分類が世界的に受け入れられていて、ジーニアス英和辞典、Oxford Advanced Learner's Dictionary 等の多くの権威ある辞書において積極的に採用されている。

通常、進行形の文は第2文型とは見なさず、動詞部分を三単現など主語に合わせた形にして文型を考える。また完了形も同様である。また受動態の文も5文型に当てはまらない。群動詞を含む文は群動詞全体を1つの動詞と考えることが多い。

ランドルフ・クァークは付加語Aを加えた考え方を提唱している。付加語Aは修飾語Mとは異なり省略することができない。この考えでは従来の5文型にSVAとSVOAという文型が加わる。また第2文型のうちVがbe動詞の場合を特別に扱う考えもある。また A・S・ホーンビーは第3文型、第4文型、第5文型のOやCが不定詞や分詞や動名詞やthat節の場合などで細かく分類した文型を提唱している。

第1文型 S+V
これは修飾語Mを除いたとき、主語Sと述語動詞Vだけで文章が完結している文型である。このときそのVを完全自動詞という。

第1文型に用いられる動詞には be, come, go などがある。
第2文型 S+V+C
これは修飾語Mを除いたとき、主語Sと述語動詞Vと主語を説明する補語Cで文章が成り立っている文型である。このときそのVを不完全自動詞という。このとき主語S⊆補語Cという関係が成立している。
第2文型における文の例：He is a teacher. 彼は先生です。
これが最も基本的な核となる部分であり、もしこれを「彼は英語の先生です。」としたいならば、 He is an English teacher. というように継ぎ足せばよい。
He is kind. He is busy. 彼は親切である。彼は忙しい。
He looks busy. 彼は忙しく見える。
This tastes good. これは美味しい味がする。
第2文型に用いられる動詞には次のものがある。
状態の維持を表す be, remain, keep, lie, stay など。
状態の変化を表す become, get, come, go など。
感覚を表す sound, feel, look, hear, smell, taste など。
感想を表す seem, appear など。
第3文型 S+V+O
これは修飾語Mを除いたとき、主語Sと述語動詞Vと動作の対象となる目的語Oで文章が成り立っている文型である。このときそのVを完全他動詞という。
第3文型における最も有名で分かり易い文としては I love you. （私はあなたを愛しています。）が挙げられる。
第4文型 S+V+IO+DO
これは修飾語Mを除いたとき、主語Sと述語動詞Vと動作を受ける間接目的語IOとその動作をする直接目的語DOで文章が成り立っている文型である。このときそのVを授与動詞という。
間接目的語IOと直接目的語DOの位置を入れ替えると、前置詞が加わってS+V+DO+前置詞+IOという形になる。このときの前置詞は to か for の場合がほとんどであり、これらの使い分けは動詞のもつ性質が相手の元に何かを届かせるタイプか相手のために何かをするタイプかで分けられる。
第4文型に用いられる動詞には次のものがある。
to が加わる give, hand, pass, offer, allow, sell, lend, owe, show, teach, tell, promise, read など。
for が加わる buy, make, get, do, find, cook, play, choose など。
第5文型 S+V+O+C
これは修飾語Mを除いたとき、主語Sと述語動詞Vと動作の対象となる目的語Oと目的語を説明する補語Cで文章が成り立っている文型である。このときそのVを不完全他動詞という。
第5文型における例文としては、 I think him a suspect. （私は彼を容疑者だと考えている。）がある。このとき目的語 O ⊆ 補語 C という関係が成立している。第5文型における、この関係はオットー・イェスペルセンが考えた用語「ネクサス」の一種である。ネクサスとは主語・述語の関係をさすが、本来の主語・述語の他に第5文型の目的語と補語のような意味上の主語・述語も含まれる。
言い換えると、OCとは、文の中心の主語述語以外で主語述語に当たるものを言うときに、主語を目的格にしてOとし、述語を動詞の原形にしたり、be動詞を省略して残したりした物をCとしているわけである。
第5文型は基本文型とされているが、元の文におけるOCが内部的にS+Cの文を含むと考えられることから、基本文型としては扱わないほうが実際的だという考えもある。
第5文型に用いられる動詞には次のものがある。
知覚動詞の feel, see, hear, watch, observe, notice, smell, perceive, taste など。
使役動詞の make, have, let, get, allow, permit, cause, force, compel, oblige など。

本稿では標準ドイツ語の文法を示す。

格
格 (Kasus, Fall) は、名詞句や代名詞が文の中でどのような役を担うかを文法的に示す語形変化であり、ドイツ語では重要である。ラテン語や古典ギリシア語などの古典語と異なり、名詞自体の格変化はごく一部に残るだけで、多くの場合は限定詞（冠詞など）が格を表示する点に特徴がある。

ドイツ語の格には主格 (Nominativ)、属格 (Genitiv)、与格 (Dativ)、対格 (Akkusativ) がある。なお日本では（学術的用途も含めて）これらの格をそれぞれ1格・2格・3格・4格と呼ぶことがある。これはドイツ語の 1. Fall, 2. Fall, 3. Fall, 4. Fall に相当し、また Werfall, Wes(sen)fall, Wemfall, Wenfall の名称もある。しかし、英米のドイツ語教育では使われず、また（表にする場合等の）順序もnominative, accusative, genitive, dative（米では dative, genitive）の順となる。ドイツ・オーストリアにおいては初等教育で 1. Fall, Werfall 等が用いられる[要出典]。なお、ドイツではラテン語は今日では必修科目ではないため（選択科目）、ラテン語起源のNominativ等を中等教育以降用いることは、ラテン語教育とは関係ない。単なる文法用語としての位置づけである[独自研究?]。

代名詞
代名詞 (Pronomen, Fürwort) は名詞句の代わりに使われる機能語である。なお、伝統的なドイツ語文法では、限定詞のことも代名詞と呼ぶ。指示限定詞の der を除き、限定詞は形を変えずに代名詞になれる。

人称代名詞
人称代名詞 (Personalpronomen, persönliches Fürwort) は話し手（一人称）、聞き手（二人称）、および文脈上明らかな第三者や物（三人称）を指し示す代名詞である。

格	一人称	二人称	三人称
男性	女性	中性	敬称
（二人称）
単数	主格 (1)	ich	du	er	sie	es	(Sie)
属格 (2)	meiner	deiner	seiner	ihrer	seiner	(Ihrer)
与格 (3)	mir	dir	ihm	ihr	ihm	(Ihnen)
対格 (4)	mich	dich	ihn	sie	es	(Sie)
複数	主格 (1)	wir	ihr	sie	Sie
属格 (2)	unser	euer	ihrer	Ihrer
与格 (3)	uns	euch	ihnen	Ihnen
対格 (4)	uns	euch	sie	Sie
敬称は二人称（単複ともに）の代わりに使われるが、文法上は三人称複数である。本来の sie と区別するため、大文字で始める。なお、英語の I は大文字で書くが、ドイツ語の ich は（文頭以外では）大文字で書かない。
三人称単数の er, sie, es はそれぞれ既出の男性・女性・中性名詞句の代わりであるが、人間を直接示す場合は er, sie を使える。つまり、少女を中性名詞の Mädchen で示しても、その後に sie を使って良い。
主格は主語に、与格は基本的に間接目的語と与格支配の前置詞の目的語、対格は直接目的語に使われる。属格は、属格支配の動詞、形容詞、前置詞などとともに用いる場合に限られる。
Ich bin Student.（私は学生です）
Gehe statt meiner!（私の代わりに行ってくれ）
Er gibt ihr das Buch.（彼は彼女にその本を与える）
Sie liebt uns.（彼女は私たちを愛している）
属格の meiner, deiner, seiner にはそれぞれ mein, dein, sein という古い形がある。
Vergiss mein nicht.（私のことを忘れないで。）→ワスレナグサ
親称・敬称
二人称は親称の du（単数）、ihr（複数）と敬称の Sie（単複同じ）があり、15歳以下の子供と大人の間では子供が大人に敬称、大人が子供に親称を用いるが、大人同士では普通互いに敬称を用いるか、親称を用いるかのいずれである。上下によるものではないため、上司に du を用いることもある。逆に上司と部下が顔を合わせる機会が少ない関係にある場合、双方から Sie で呼び合うこともある。なお、書籍などではポライトネスが直接要求されないため du を用いるのが普通（例えば「参照せよ」「…ページを見よ」などは du に対する命令形を用いる）。また、ドイツ語版ウィキペディアのコミュニティーにおいても du が用いられている。 大人の間では一般的に du の呼称は与えられるものである。 Sie で呼び合う関係がより親密になったことで「今日から私を du と呼べ」などと言われる（相手を du で呼ぶ許可も暗に求めている）。これ以外で du を用いると非常な失礼に当たるし、du で呼び合う関係でありながら改まった席でもないのに Sie を用いるとそれまでの良好な関係を否定することにつながる。なお、ドイツ語話者は du で呼びあう関係では場面を問わず du を用いるのが一般的。

呼びかけには Sie で呼ぶ人には「～さん、～様」に当たる「Herr（男性）/Frau（女性） + 苗字または肩書き」を用い、du で呼ぶ人にはファーストネームまたは愛称を用いるのを基本とし、年下の相手には Sie を用いていてもファーストネームで呼び掛けることも少なくない。親密になって Sie で呼びあう関係から du で呼びあう関係に移行した時、同時に「Herr/Frau...」という呼び方をやめてファーストネームに呼び変える。

指示代名詞
指示代名詞 (Demonstrativpronomen, hinweisendes Fürwort) は、会話の場や文脈において人や物を直接指す限定詞・代名詞である。

格	単数	複数
男性	女性	中性
主格 (1)	dieser	diese	dieses	diese
属格 (2)	dieses	dieser	dieses	dieser
与格 (3)	diesem	dieser	diesem	diesen
対格 (4)	diesen	diese	dieses	diese
この dieser と同じ格変化をする指示代名詞には、jener と solcher がある。
疑問代名詞 welcher、不定代名詞 jeder（ただし単数のみ）、不定数詞 aller, mancher も dieser と同じ格変化をする。
格	単数	複数
男性	女性	中性
主格 (1)	der	die	das	die
属格 (2)	dessen	deren	dessen	deren
与格 (3)	dem	der	dem	denen
対格 (4)	den	die	das	die
der が限定詞である時の格変化は定冠詞と同じであるが、代名詞の時は上記の表のようになる。
複数属格には deren の他にふつう関係代名詞の先行詞として用いられる derer がある。
事物をさす指示代名詞が前置詞と融合して da-（その前置詞が母音で始まっているときは dar-）になることがある。この場合は大抵 da- にアクセントがある。damit, daraus など。
所有代名詞
ドイツ語の文法では、所有限定詞をしばしば「所有代名詞」(Possessivpronomen, besitzanzeigendes Fürwort) と呼ぶ。

格	単数	複数
男性	女性	中性
主格 (1)	mein	meine	mein	meine
属格 (2)	meines	meiner	meines	meiner
与格 (3)	meinem	meiner	meinem	meinen
対格 (4)	meinen	meine	mein	meine
所有代名詞には上記 mein のほかに、dein, sein, ihr, unser, euer, Ihr があり、同じ格変化をする。
否定を表す不定代名詞 kein も mein と同じ格変化をする。
Ich bin kein Student. Ich bin noch Schüler.
（私は大学生ではありません。まだ生徒です）
注) ドイツ語の Student（男子学生）、Studentin（女子学生）は大学生を指すときに使い、それよりも下の学校の生徒には Schüler（男子生徒）、Schülerin（女子生徒）を使う。
英語であれば、上記の文は、
I am not a student. I am still a pupil.
となるが、ドイツ語では nicht を使うより上記の文のほうが普通である。
関係代名詞
関係代名詞 (Relativpronomen, bezügliches Fürwort) は関係節を導く代名詞である。

格	単数	複数
男性	女性	中性
主格 (1)	der	die	das	die
属格 (2)	dessen	deren	dessen	deren
与格 (3)	dem	der	dem	denen
対格 (4)	den	die	das	die
指示代名詞 der の名詞的用法と同じである。
関係代名詞 welcher は dieser と同じ格変化であるが、属格の形は用いられない。
事物を先行詞とする関係代名詞が前置詞と一緒に用いられると、wo-（その前置詞が母音で始まっているときは wor-）になることがある。
例: womit, woran など
疑問代名詞
疑問代名詞 (Interrogativpronomen, fragendes Fürwort) は疑問文において内容が問われる代名詞である。

格	人	事物
主格 (1)	wer	was
属格 (2)	wessen	wessen
与格 (3)	wem	was
対格 (4)	wen	was
wessen には wes という古い形がある。
was の属格はほとんど用いられない。与格の was はふつう俗語である。
was が前置詞と一緒に用いられると、wo-（その前置詞が母音で始まっているときは wor-）となる。例: woher, worauf など。
疑問代名詞 welcher は指示代名詞 dieser と同じ格変化をする。
疑問代名詞 was für ein では、ein が不定冠詞の格変化をする。was für ein が名詞的に用いられると ein は不定代名詞 einer と同じ格変化をする。
不定代名詞
不定代名詞 (Indefinitpronomen, unbestimmtes Fürwort) は不定の人や物を指す代名詞である。

主格 (1)	man	jemand	niemand	jedermann
属格 (2)	(eines)	jemand[e]s	niemand[e]s	jedermanns
与格 (3)	einem	jemand[em]	niemand[em]	jedermann
対格 (4)	einen	jemand[en]	niemand[en]	jedermann
man を er で受けることはできない。代わりに man を繰り返す。ただし、所有代名詞は sein を用いる。
これらの不定代名詞は三人称単数として扱われる。
以下は不定限定詞である。

格	単数	複数
男性	女性	中性
主格 (1)	einer	eine	ein[e]s	welche
属格 (2)	(eines)	(einer)	(eines)	(welcher)
与格 (3)	einem	einer	einem	welchen
対格 (4)	einen	eine	ein[e]s	welche
属格はふつう用いられない。
語尾は指示代名詞 dieser と同じである。
kein が名詞的に用いられると dieser と同じ格変化をする。
etwas と nichts は格変化しない。
再帰代名詞
再帰代名詞 (Reflexivpronomen, rückbezügliches Fürwort) は主語と同一の人や物を指す代名詞である。主格は存在しない。また、一・二人称は人称代名詞と同じである。

格	一人称	二人称	三人称
男性	女性	中性	敬称
（二人称）
単数	主格 (1)	-	-	-	-	-	(-)
属格 (2)	meiner	deiner	seiner	ihrer	seiner	(Ihrer)
与格 (3)	mir	dir	sich	(sich)
対格 (4)	mich	dich	sich	(sich)
複数	主格 (1)	-	-	-	-
属格 (2)	unser	euer	ihrer	ihrer
与格 (3)	uns	euch	sich	sich
対格 (4)	uns	euch	sich	sich
再帰代名詞とは、主に三人称の主語が自分（達）のために行う行為を表すために用いられる。
Er kauft ihm das Buch.（彼は彼（主語とは別人）にその本を買う。）
Er kauft sich das Buch.（彼は自分のためにその本を買う。）
通常の代名詞と同じく、meiner, deiner, seiner にはそれぞれ mein, dein, sein という古い形がある。
再帰の意味を明確にするために selbst と一緒に用いられることがある。属格を目的語にとる動詞が三人称で再帰的に使われるときは必須となる。
Er spottet seiner selbst.（彼は自嘲する。）
再帰代名詞の複数は相互代名詞として用いられることがある。
Wir lieben uns.（私達は愛し合っている。）
動詞
主文の定動詞は文の構成要素の内、2番目におかれる。V2語順を参照すること。このため、英語とは異なり、主語が最初に来ないとき、主語は動詞の次におかれる。主語は原則として省略はされない。

ドイツ語の動詞は、法・態・時制・人称・数に従って活用する。動詞は規則変化する動詞と不規則変化をする動詞に分かれる。規則変化する動詞は弱変化動詞ともいい、不規則変化をする動詞は強変化動詞、混合変化動詞、そして若干の本来の不規則変化動詞（sein, werden等）に分類される。ただしこの分類は、主に不定形・過去基本形・過去分詞の形態の変化に基くもので、人称および数に従う変化は語尾の規則的変化である場合が多い。

ドイツ語の時制は、現在と過去である。英語では、未来を表す時は一般に助動詞 will を加えるが、ドイツ語では未来の事象について助動詞 werden は必須ではなく、むしろ推測の意味が前面に出るので、時制とはいいきれない。

ドイツ語では対格目的語をとるものを「他動詞」という。他動詞は haben 支配である。

規則動詞
規則動詞の活用を、「学ぶ」という意味の規則動詞 lernen（語幹 lern + 語尾 en）を例として示す。

動詞の3基本形
不定詞: 語幹 + en
lernen
過去基本形: 語幹 + te
lernte
過去分詞: ge + 語幹 + t
gelernt
現在
単数	複数
一人称	-e (lerne)	-en (lernen)
二人称	-st (lernst)	-t (lernt)
三人称	-t (lernt)	-en (lernen)
敬称の二人称 (Sie) は文法的には三人称複数なので、lernen と活用する。

接続法第I式
単数	複数
一人称	-e (lerne)	-en (lernen)
二人称	-est (lernest)	-et (lernet)
三人称	-e (lerne)	-en (lernen)
過去
-∅ はゼロ接辞を表す。

単数	複数
一人称	-∅ (lernte)	-(e)n (lernten)
二人称	-st (lerntest)	-t (lerntet)
三人称	-∅ (lernte)	-(e)n (lernten)
強変化動詞
強変化動詞の活用を、「見つける」という意味の動詞 finden（語幹 find + 語尾 en）を例として示す。語尾変化は規則動詞と同様。

動詞の3基本形
不定詞: 語幹 + en
finden
過去基本形: 語幹（変音）
fand
過去分詞: ge + 語幹（変音） + en
gefunden
混合変化動詞
混合変化動詞の活用を、「知る」という意味の動詞 kennen（語幹 kenn + 語尾 en）を例として示す。語尾変化は規則動詞と同様。

動詞の3基本形
不定詞: 語幹 + en
kennen
過去基本形: 語幹（変音） + te
kannte
過去分詞: ge + 語幹（変音） + t
gekannt
sein の活用
sein はコピュラであり、英語の be、フランス語の être などに相当する。日本語では「である」、「ある」と訳される。 定動詞としての用法のほか、完了時制の助動詞となる。

動詞の3基本形
不定詞
sein
過去基本形
war
過去分詞
gewesen
現在
単数	複数
一人称	bin	sind
二人称	bist	seid
三人称	ist	sind
敬称の二人称 (Sie) は文法的には三人称複数なので、sind を用いる。

接続法第I式
単数	複数
一人称	sei	seien
二人称	seiest	seiet
三人称	sei	seien
過去
単数	複数
一人称	war	waren
二人称	warst	wart
三人称	war	waren
haben の活用
haben は、英語の have などに相当する。日本語では「持つ」と訳されることもある。定動詞としての用法のほか、完了時制の助動詞としても使われる。

動詞の3基本形
不定詞
haben
過去基本形
hatte
過去分詞
gehabt
現在
単数	複数
一人称	habe	haben
二人称	hast	habt
三人称	hat	haben
敬称の二人称 (Sie) は文法的には三人称複数なので、haben を用いる。

接続法第I式
単数	複数
一人称	habe	haben
二人称	habest	habet
三人称	habe	haben
過去
単数	複数
一人称	hatte	hatten
二人称	hattest	hattet
三人称	hatte	hatten
werden の活用
werden も、上記 sein, haben に劣らず重要な動詞である。本動詞として「～になる」（英語: become）の意味をもつほか、過去分詞と共に受動態、不定詞と共に未来（あるいは推量）を作る助動詞でもある。

動詞の3基本形
不定詞
werden
過去基本形
wurde
過去分詞
geworden（本動詞 werden の場合）/ worden（受動態を作る助動詞 werden の場合）
過去・接続法は規則どおりであるが、現在は不規則である。

現在
単数	複数
一人称	werde	werden
二人称	wirst	werdet
三人称	wird	werden
複合動詞
複合動詞 (zusammengesetztes Verb) とは複合語の動詞である。前つづり（接頭辞）により挙動が異なる。

種類	前つづり	特徴
非分離	be-, emp-, ent-, er-,
ge-, ver-, zer-; miss-	
前つづりに強勢が無い。
zu 不定詞は通常の動詞と同じ。（例: zu verstehen）
過去分詞に ge- を付けない。語頭に許される非強勢音節は 1 個だけのため。（例: verstanden）
分離	an-, auf-, aus-, bei-,
mit-, nach-, vor-, zu-; ab-, ein-, empor-, fort-, hin-, her-, los-, weg-, zurück-, zusammen- など	
前つづりに強勢がある。
V2語順により動詞が移動するときは、前つづりを分離する。
不定詞の zu は前つづりの後ろに置かれる。（例: aufzustehen）
過去分詞の ge- は前つづりの後ろに置かれる。（例: aufgestanden）
両方	durch-, hinter-, über-, um-, unter-, voll-, wider-, wieder-	これらの前つづりは分離、非分離の両方がある。強勢の有無で区別できる。
名詞
名詞 (Substantiv, Hauptwort) は必ず大文字から始まる。なお代名詞は名詞ではない。また、男性・女性・中性の性を持ち、それぞれ男性名詞 (Maskulinum (m.) – ein männliches Hauptwort)・女性名詞 (Femininum (f.) – ein weibliches Hauptwort)・中性名詞 (Neutrum (n.) – ein sächliches Hauptwort) という。また、複数 (Plural, 略: Pl.) になると、名詞の性に関わらず複数の形を取る。

複数型の語尾には、-（無語尾）, -e, -er, -(e)n, -sの五つのパターンが存在する。名詞の複数形は、名詞の性および単数形の語尾と密接な関係がある。-sによる複数は外来語や略語、他の品詞が名詞化された場合などに用いられる。他の四つは次のようになる。

-el, -en, -erで終わる名詞（女性名詞に-enはない）
男性：無語尾（幹母音がウムラウトするものとしないものがある。）
　　　-n（-erで終わる弱変化名詞。非常に少数。主格以外の単数形にも-nを付ける。弱変化でない男性名詞はVetterのみ。）
中性：無語尾（幹母音はウムラウトしない。例外はKlosterのみ。）
　　　-leinで終わる名詞もこれに準じて無語尾。
女性：-n
　　　無語尾（MutterとTochterのみ。幹母音がウムラウトする。）
上記以外の子音で終わる名詞
男性：-e（大多数。幹母音がウムラウトするものとしないものがある。）
　　　-en（弱変化名詞。主格以外の単数形にも-enを付ける。Herrは主格以外の単数形には-n、複数形には-enを付ける。弱変化名詞でない男性名詞はNachbar, Mast, Schmerz, Staat, Strahlおよび-orで終わる外来語のみ。）
　　　-er（Geist, Gott, Irrtum, Leib, Mann, Rand, Reichtum, Strauch, Wald, Wurmのみ。幹母音はウムラウトする。）
中性：-e（幹母音はウムラウトしない。例外はFloßのみ。）
　　　-er（幹母音はウムラウトする。）
　　　-en（Ohr, Bett, Hemd, Insektのみ。Herzは複数が-enとなるだけでなく、単性属格が-ens、単数与格・対格が-enとなる。）
女性：-en（大多数）
　　　-e（幹母音はウムラウトする。）
-e（圧倒的に女性名詞が多い。）
男性：-n（弱変化名詞。主格以外の単数形にも-nを付ける。Buchstabe, Funke, Gedanke, Glaube, Name, Willeは単数属格が-nsとなる。弱変化名詞でない男性名詞は「湖」という意味のSeeのみ。）
中性：無語尾（Ge-で始まる名詞）
　　　-n（Auge, Endeのみ）
女性：-n
女性名詞は圧倒的に-(e)n型が多く、-er型はない。また女性名詞は冠詞等によって与格以外の単数形と複数形を区別することができないので、幹母音がウムラウトしない無語尾型はない。（幹母音がウムラウトする無語尾型も上に示したようにMutterとTochterのみ。）

無語尾型は本来は-e型だったが、アクセントのないeが二つ重なるのを避けるために省略されたもの。（同様の理由で-el, -en, -erで終わる男性・中性の単数与格に-eは付けないし、単数属格は-esとはならず常に-sである。）-e型及び無語尾型の幹母音は、女性名詞は必ずウムラウトし、中性名詞は上に示した極少数の例外を除きウムラウトしない。男性名詞はウムラウトする場合としない場合があるので、一つずつ覚えなければならない。

-er型は本来中性名詞の一部にのみ用いられていたが、勢力を拡大し、一部の男性名詞にも用いられるようになった。幹母音は必ずウムラウトする。

その他の外来語（ラテン語・ギリシア語）

-umで終わる中性名詞：-en
-al, -ilで終わる中性名詞：-alien, -ilien
-ismusで終わる男性名詞：-ismen
中性名詞 Klima のようにギリシャ語、ラテン語と同様の複数形を持つ場合もある。

ドイツ語の名詞句を構成する冠詞、形容詞、名詞には、いずれも格変化が存在する。しかし、ラテン語やギリシャ語と違い、構成要素のうちいずれか一カ所で性・数・格の判別がつくのであれば他の部分は必ずしもそれらを明示しなくてもよいという特徴を持つ（例に挙げた二つの言語では全ての要素の性・数・格を一致させる）。したがって、名詞句の構成のされ方によってどの部分で格が示されるかに注意を払う必要がある。

また、ドイツ語では複合名詞が作りやすいため、よく使われている。複合名詞は複数の名詞をスペースを入れずにつなげて表記するので、そのままでは辞書に出てこない場合も多い。

冠詞
冠詞には定冠詞 der（英語の the）と不定冠詞 ein（英語の a/an）, keinがある。複数の不定はゼロ冠詞である。

単数	複数
男性	女性	中性
定	der Vater	die Mutter	das Kind	die Briefe
不定	ein Vater	eine Mutter	ein Kind	Briefe
格変化
定冠詞の付いた名詞句の格変化 (Deklination) を以下に示す。

格	単数	複数
男性	女性	中性
主格 (1)	der Vater	die Mutter	das Kind	die Briefe
属格 (2)	des Vaters	der Mutter	des Kindes	der Briefe
与格 (3)	dem Vater	der Mutter	dem Kind	den Briefen
対格 (4)	den Vater	die Mutter	das Kind	die Briefe
ちなみに少し古いドイツ語では、男性・中性名詞（語尾が-el, -en, -erのものと、男性弱変化名詞は除く）の単数与格には、 -e の語尾が（ギリシャ語の与格のイオタと同様）付いていた。また複数が-(e)nとなる女性名詞は本来弱変化名詞で、主格以外の単数形にも-(e)nが付いていた。そのため現代ドイツ語でも熟語化した表現にはこの語尾が現れることがある。例えば nach Hause や zu Hause、auf Erden など。

形容詞
形容詞 (Adjektiv, Eigenschafts- oder Beiwort) には叙述用法と限定用法があり、前者では不変化である（語尾がつかない）が、後者では修飾する名詞の性・格・数に一致して変化し、その変化のしかたは定冠詞類の有無によって異なる。

常に修飾する名詞の性・格・数に影響を受けない無変化形容詞もある。外来語の形容詞の一部(prima, klasse, rosa, lilaなど)や、地名や数詞に -er を付加して得られる形容詞(Wiener Kaffee「ウィンナ・コーヒー」, in den 90er Jahren「90年代」)がそうである。

英語と同様の比較級(-er)と最上級(-(e)st)も存在するが、これらも限定用法では形容詞語尾が付加される。一部の形容詞の比較級・最上級は不規則である（gut - besser - bestなど）。

以下に、gut を例に変化を示す。

強変化（形容詞 + 名詞）
定冠詞（類）と同様に強変化する。属格で語尾に -(e)s を伴う大半の男・中性名詞に形容詞がついた時はその形容詞は弱変化する（語尾 -en が付く）が、男性弱変化名詞は属格を示す語尾がない為、形容詞は強変化する（語尾 -es が付く）。

格	単数	複数
男性	男性弱変化	女性	中性
主格 (1)	guter Vater	guter Mensch	gute Mutter	gutes Kind	gute Briefe
属格 (2)	guten Vaters	gutes Menschen	guter Mutter	guten Kind(e)s	guter Briefe
与格 (3)	gutem Vater	gutem Menschen	guter Mutter	gutem Kind(e)	guten Briefen
対格 (4)	guten Vater	guten Menschen	gute Mutter	gutes Kind	gute Briefe
弱変化（定冠詞類 + 形容詞 + 名詞）
定冠詞類が格変化するので弱変化になる。

格	単数	複数
男性	女性	中性
主格 (1)	der gute Vater	die gute Mutter	das gute Kind	die guten Briefe
属格 (2)	des guten Vaters	der guten Mutter	des guten Kindes	der guten Briefe
与格 (3)	dem guten Vater	der guten Mutter	dem guten Kind(e)	den guten Briefen
対格 (4)	den guten Vater	die gute Mutter	das gute Kind	die guten Briefe
混合変化（不定冠詞類 + 形容詞 + 名詞）
基本的に不定冠詞が格変化して弱変化になる。不定冠詞が弱変化のところ（男性主格・中性主格・中性対格）のみ強変化になる。

格	単数	複数
男性	女性	中性
主格 (1)	ein guter Vater	eine gute Mutter	ein gutes Kind	meine guten Briefe
属格 (2)	eines guten Vaters	einer guten Mutter	eines guten Kindes	meiner guten Briefe
与格 (3)	einem guten Vater	einer guten Mutter	einem guten Kind(e)	meinen guten Briefen
対格 (4)	einen guten Vater	eine gute Mutter	ein gutes Kind	meine guten Briefe
命令法
命令形の形
現代ドイツ語の命令法（独：Imperativ）には、２人称du (君), ihr (君たち), Sie (あなた、あなた方）に対する形が存在する。du, ihrに対する命令形は主語がない（Komm!「来い」）。それに対して敬称のSieに対する命令形は、主語が存在する（Kommen Sie!）。その点で接続法Ⅰ式に対応していると言える。活用は主に次のようになる。

不定詞　-(e)n
duに対して　- (e)!　　　　　　Sag(e)!　言え！
ihrに対して　- (e)t!　　　　　 Sagt!
Sieに対して　-(e)n　Sie!　　　Sagen Sie!
例外としてseinは次のように不規則変化をする。

duに対して　Sei!
ihrに対して　Seid!
Sieに対して　Seien Sie!
duに対する命令形の作り方
語尾-e
動詞語幹に語尾-eをつけるか、語尾をつけない。語尾-eは口語では省略することが多い。
（例）Schlaf(e)!　寝なさい！
不定詞の語幹が-d, -t, -tel, -er, -igで終わる動詞
ただし、不定詞の語幹が-d, -t, -tel, -er, -igで終わる動詞（例：läden, arbeiten, basteln, ändern, entschuldigen）の場合には、語尾に-eを省略しない。
（例）Antworte auf meine Frage!　私の質問に答えよ！
変音（ウムラウト）する動詞
変音（ウムラウト）する動詞（例： schlagen, tragen）の場合、命令形では変音しない。
（例）duに対して　Fahre langsamer!　もっとゆっくり走行せよ！　×Fähre
幹母音eが2人称・3人称単数でiあるいはieに変化する動詞
2人称・3人称単数で幹母音eがiあるいはieになる動詞（例：geben, sehen）の命令形は、現在人称変化から人称語尾を取り除いた形となり、-eは付けない。ただし、sehenのihrとSieに対する命令形は、一般の命令形と同じ変化である。
（例）duに対して　Sprich nicht so schnell!　そんなに速く話さないで！
ihrに対して　Sprecht nicht so schnell!
Sieに対して　Sprechen Sie nicht so schnell!
幹母音がeからiになる動詞の例外として、werdenがある。
（例）duに対して　Werde! 　×Wird!
ihrに対して　Werdet!
Sieに対して　Werden Sie!
命令法での注意点
分離動詞
分離動詞（例：anrufen, aufmachen）の場合、命令形では分離する。
（例）Hör(e) mir zu!　私の言うことを聞け！
再帰動詞
再帰動詞（例：sich ansehen, sich lassen）の場合、再帰目的語は主語の人称に従う。
（例）duに対して　Leg(e) dich hin!　横たわれ！
ihrに対して　Legt euch hin!
Sieに対して　Legen Sie sich hin!
書き言葉で使われる特別なsiehe
論文などの文章中に使われる「参照せよ」の場合には、sieheというeが付く形が使われるが、その場合には感嘆符は使用されない。
（例）Siehe S.40.　「40ページを見よ。」
`
